//
//  DataManager.swift
//  ContactsList
//
//  Created by Денис on 02.05.2022.
//

import Foundation

class DataManager {
    
    let surnames = ["Пупков",
                    "Пальчиков",
                    "Попкин",
                    "Ковыряйкин",
                    "Свифтом",
                    "Паскалев",
                    "Жабов",
                    "Куркин",
                    "Черепахов",
                    "Страусов",
                    "Лимонов",
                    "Дроздов",
                    "Пупыркин"]
    
    let names = ["Денис",
                 "Влад",
                 "Иван",
                 "Михаил",
                 "Геннадий",
                 "Роман"]
    
    let patronymics = ["Петрович",
                      "Иванович",
                      "",
                      "Александрович",
                      "Анатольевич",
                      "Владиславович"]
    
    let phones = ["11111111",
                  "22222222",
                  "33333333",
                  "44444444",
                  "55555555",
                  "66666666",
                  "77777777",
                  "88888888"]
    
    let mails = ["aaa@t.ru",
                 "bbb@t.ru",
                 "ccc@t.ru",
                 "qqq@t.ru",
                 "www@t.ru",
                 "zzz@t.ru",
                 "ooo@t.ru",
                 "jjj@t.ru"]
    
}
